Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/overview_people_granted_refugee_status_.html.txt.tmx
Source language: en
Languages: ga

source: Overview: people granted refugee status or subsidiary protection or permission to remain
ga: Forbhreathnú: daoine ar deonaíodh stádas dídeanaí nó cosanta coimhdí dóibh nó ar tugadh cead dóibh chun fanacht

source: • Where to get more information
ga: • Cá féidir liom teacht ar bhreis faisnéise?

source: Asylum seekers who have been granted international protection (refugee status or subsidiary protection) or permission to remain have the right to live and work in Ireland
ga: Tá an ceart ag iarrthóirí tearmainn ar deonaíodh cosaint idirnáisiúnta (stádas dídeanaí nó cosanta coimhdí) dóibh nó ar tugadh cead dóibh chun fanacht chun cónaí agus oibriú in Éirinn

source: In most cases, this will mean leaving direct provision accommodation to find work and somewhere to live
ga: I bhformhór na gcásanna, is éard a chiallóidh seo ná cóiríocht soláthair dhírigh a fhágáil chun obair agus áit éigin a aimsiú le cónaí ann

source: The change from direct provision to living independently may involve a number of issues including housing, employment, health services, managing money and social welfare
ga: D’fhéadfadh roinnt saincheisteanna a bheith i gceist leis an athrú ó sholáthar díreach go dtí maireachtáil neamhspleách, ina measc tithíocht, fostaíocht, seirbhísí sláinte, airgead a bhainistiú agus leas sóisialach

source: If you have been living in a direct provision accommodation centre, you will have to leave that centre and move into other accommodation
ga: Má bhí tú i do chónaí in ionad cóiríochta soláthair dhírigh, beidh ort an t-ionad sin a fhágáil agus bogadh isteach i gcóiríocht eile

source: This could be in social housing (public housing) or in private rented housing
ga: D’fhéadfadh tithíocht shóisialta (tithíocht phoiblí) nó tithíocht phríobháideach ar cíos a bheith i gceist leis seo

source: If you were already living in private rented accommodation, your change of status will not affect your immediate housing situation
ga: Má bhí cónaí ort cheana féin i gcóiríocht phríobháideach ar cíos, ní imreoidh d’athrú stádais tionchar ar do chúinsí láithreacha tithíochta

source: If you find yourself homeless, there are agencies that provide services for homeless people
ga: Má bhíonn tú gan dídean, tá roinnt gníomhaireachtaí ann a sholáthraíonn seirbhísí do dhaoine gan dídean

source: When you are granted refugee status or subsidiary protection or permission to remain, you should apply for any social welfare payments for which you are eligible
ga: Nuair a dheonaítear stádas dídeanaí nó cosanta coimhdeach duit nó nuair a thugtar cead duit chun fanacht, ba cheart duit iarratas a dhéanamh ar aon íocaíochtaí leasa shóisialaigh atá tú i dteideal a fháil

source: You will satisfy the habitual residence condition, but you will have to meet other conditions
ga: Sásóidh tú coinníoll an ghnáthchónaithe, ach beidh ort coinníollacha eile a chomhlíonadh

source: Your local social welfare office or Intreo centre will help you to apply for the correct payment for your situation
ga: Cabhróidh d’ionad áitiúil leasa shóisialaigh nó d’ionad Intreo leat chun cabhrú leat iarratas a dhéanamh ar an íocaíocht cheart do do chás

source: • If you are able to work but are unemployed, you may get Jobseeker’s Allowance
ga: • Má tá tú in ann oibriú ach má tá tú dífhostaithe, féadfaidh tú Liúntas Cuardaitheora Poist a fháil

source: Our checklist for unemployed people has links to information about services and entitlements for unemployed people
ga: Tá naisc ag ár seicliosta do dhaoine dífhostaithe le faisnéis faoi sheirbhísí agus teidlíochtaí do dhaoine dífhostaithe

source: • If you are unable to work due to disability or illness, you can apply for Disability Allowance
ga: • Mura féidir leat oibriú i ngeall ar mhíchumas nó ar bhreoiteacht, féadfaidh tú iarratas a dhéanamh ar Liúntas Míchumais

source: You can also find out more in our checklist of the main services and entitlements for people with disabilities
ga: Chomh maith leis sin, féadfaidh tú teacht ar bhreis eolais inár seicliosta de na príomhsheirbhísí agus na príomhtheidlíochtaí do dhaoine faoi mhíchumas

source: • If you are the parent or guardian of a child you can apply for Child Benefit
ga: • Más tuismitheoir nó caomhnóir linbh thú, féadfaidh tú iarratas a dhéanamh ar Shochar Linbh

source: If you need childcare, you can view our childcare checklist
ga: Má theastaíonn cúram leanaí uait, féadfaidh tú súil a chaitheamh ar ár seicliosta cúram leanaí

source: • If you are parenting alone you can apply for One-Parent Family Payment
ga: • Má tá tuistiú á dhéanamh agat i d’aonar, féadfaidh tú iarratas a dhéanamh ar Íocaíocht Teaghlach Aontuismitheora

source: You can find out more in our checklist of the main services and entitlements for people parenting alone
ga: Chomh maith leis sin, féadfaidh tú teacht ar bhreis eolais inár seicliosta de na príomhsheirbhísí agus na príomhtheidlíochtaí do dhaoine a bhfuil tuistiú aonair á dhéanamh acu

source: You have the right to work, so you may find our document on looking for work and getting a job helpful
ga: Tá an ceart i leith oibre agat, mar sin, b’fhéidir go dtabharfaidh ár gcáipéis ar obair a chuardach agus post a fháil lámh chúnta duit

source: Your local Intreo centre or employment services office provides information and advice for jobseekers, including a list of job vacancies
ga: Soláthraíonn d’ionad áitiúil Intreo nó d’oifig seirbhísí fostaíochta faisnéis agus comhairle do chuardaitheoirí poist, ina measc liosta d’fholúntais phoist

source: The Jobs Ireland website lists jobs that are available
ga: Liostaítear ar láithreán gréasáin Jobs Ireland na poist atá ar fáil

source: It also lists employment support scheme vacancies
ga: Liostaítear, chomh maith leis sin, folúntais i scéimeanna tacaíochta fostaíochta

source: When you do find work, you should find out about your employment rights, which are protected by employment law
ga: Nuair a éiríonn leat obair a aimsiú, ba cheart duit faisnéis a fháil faoi do chearta fostaíochta, a ndéanann dlí fostaíochta a chosaint

source: Specific legislation exists to protect your human rights and ensure equality at work and there are procedures to assist you to enforce your employment rights
ga: Is ann do reachtaíocht shonrach chun do chearta daonna a chosaint agus comhionannas ag an obair a chinntiú agus is ann do nósanna imeachta chun cabhrú leat chun do chearta fostaíochta a fhorfheidhmiú

source: The medical services you received as an asylum seeker will continue if you have been granted refugee status or subsidiary protection or permission to remain
ga: Leanfaidh na seirbhísí leighis a fuair tú mar iarrthóir tearmainn má deonaíodh stádas dídeanaí nó cosanta coimhdí duit nó má tugadh cead duit chun fanacht

source: The medical card gives you and your family access to medical services free of charge (some prescription charges apply)
ga: Tugann an cárta leighis rochtain duit féin agus do do theaghlach ar sheirbhísí leighis saor in aisce (baineann roinnt muirir oidis)

source: If you do not qualify for a medical card, you will be asked to pay for certain medical services
ga: Mura gcáilíonn tú do chárta leighis, iarrfar ort íoc as seirbhísí áirithe leighis

source: Contact your Local Health Office for details of GPs (family doctors) in your area
ga: Déan teagmháil le d’Oifig Sláinte Áitiúil chun teacht ar shonraí faoi LGanna (dochtúirí teaghlaigh) i do cheantar

source: All children and young people, including those granted refugee status or subsidiary protection or permission to remain, are entitled to free primary and post-primary education
ga: Tá gach leanbh agus duine óg, iad siúd san áireamh a ndeonaítear stádas dídeanaí nó cosanta coimhdí dóibh nó ar tugadh cead dóibh chun fanacht, i dteideal bunoideachas agus iar-bhunoideachas saor in aisce a fháil

source: You can read more about this and about further and third-level education in our document on education for people with refugee status or subsidiary protection or permission to remain
ga: Féadfaidh tú níos mó a léamh faoi seo agus faoi bhreisoideachas agus faoi oideachas tríú leibhéal inár gcáipéis ar oideachas do dhaoine ag a bhfuil stádas dídeanaí nó cosanta coimhdí nó ar tugadh cead dóibh chun fanacht

source: If you are unemployed there are different education and training opportunities that include courses specifically for unemployed people
ga: Má tá tú dífhostaithe, tá deiseanna oideachais agus oiliúna éagsúla ann, lena n-áirítear cúrsaí atá dírithe go sonrach ar dhaoine dífhostaithe

source: Where to get more information
ga: Cá féidir liom teacht ar bhreis faisnéise?

source: The Department of Justice and Equality has published a guide to living independently (pdf) for people who have been granted refugee status or subsidiary protection or permission to remain
ga: D’fhoilsigh an Roinn Dlí agus Cirt agus Comhionannais treoir maidir le maireachtáil neamhspleách (pdf) do dhaoine ar deonaíodh stádas dídeanaí nó cosanta coimhdí dóibh nó ar tugadh cead dóibh chun fanacht

source: For information and advice about leaving direct provision accommodation, you can contact your local Citizens Information Centre
ga: Chun teacht ar fhaisnéis agus ar chomhairle faoi chóiríocht soláthair dhírigh a fhágáil, féadfaidh tú teagmháil a dhéanamh le d’Ionad áitiúil um Fhaisnéis do Shaoránaigh

source: The Money Advice and Budgeting Service (MABS) is a free and confidential service that can help people manage their money
ga: Seirbhís saor in aisce agus rúnda is ea an tSeirbhís Bhuiséadta agus Chomhairle Airgid (an SBCA) ar féidir léi cabhrú le daoine bainistiú a dhéanamh ar a n-airgead
